#+title: Amazon AWS Ubuntu
* Amazon AWS Ubuntu
  固定 IP は有料.

** ping
  - [[http://qiita.com/janus_wel/items/faac04f2ec2cdb50d074][ssh config を汚さずに Ansible で Vagrant ホストを扱う - Qiita]]

#+begin_src bash
mkdir -p ~/.emacs.d/playbook
cd ~/.emacs.d/playbook
echo '54.65.121.127' > hosts
#+end_src

   以下の作業はすべて,~/.emacs.d/playbook で実施.

   ansible.cfg ファイルを作成.

   #+begin_src text
   [defaults]
   hostfile = ./hosts
   remote_user = ubuntu
   private_key_file = ~/.ssh/archlinux.pem
   host_key_checking = False
   #+end_src

   ping する.

#+begin_src bash :results raw silent :export both 
ansible all -m ping -i hosts
#+end_src

#+RESULTS:
54.64.58.11 | success >> {
    "changed": false, 
    "ping": "pong"
}


#+begin_src bash :results raw :export both 
ansible all -i hosts -a 'uname -r'
#+end_src

#+RESULTS:
54.64.58.11 | success | rc=0 >>
3.13.0-36-generic

** initial tools
   - [[http://gihyo.jp/admin/serial/01/ubuntu-recipe/0235][第 235 回  Ubuntu 12.04 で Emacs 24.1 を使う:Ubuntu Weekly Recipe|gihyo.jp … 技術評論社]]
   - [[http://emacs.tsutomuonoda.com/emacs24-1-ubuntu-install/][Emacs24.1 を Ubuntu にインストールする | Emacs の elisp インストール・設定・使い方]]

#+begin_src yaml :tangle yes
---
- hosts: defaults
  sudo: yes
  vars:
    home_dir: /home/ubuntu
    emacs_dir: emacs
    dotfiles_dir: ditfiles
  tasks:
    # - name: apt-get update
    #   command: apt-get update
    - name: apt-get install git
      apt: pkg=git
    - name: apt-get install tools
      apt: pkg=automake,make,g++,build-essential,autoconf,texinfo
    - name: apt-get install image libraries
      apt: pkg=libXpm-dev,libjpeg-dev,libgif-dev libtiff4-dev, libncurses5-dev, libgtk2.0
#+end_src

** install emacs
  - [[http://qiita.com/seizans/items/f5f052aec1592c47767f][Ansible で git clone させる - Qiita]]

#+begin_src yaml :tangle yes
    - name: get emacs from git repository
      git: repo=git://git.savannah.gnu.org/emacs.git
           dest=~/ update=no accept_hostkey=True
    - name: setup emacs building
      command: ./autogen.sh && ./configure chdir={{home_dir}}/{{emacs_dir}}
    - name: make emacs
      command: make chdir={{home_dir}}/{{emacs_dir}}
      debug: var=ls_result.stdout
    - name: install emacs
      command: make install chdir={{home_dir}}/{{emacs_dir}}
      debug: var=ls_result.stdout
#+end_src

** install dotfiles
#+begin_src yaml :tangle yes
    - name: clone dotfiles
      git: repo=git@github.com:tsu-nera/dotfiles.git
           dest=~/ update=no accept_hostkey=True
    - name: make lnlinks
      command: ./make_lnlink  chdir={{home_dir}}/{{dotfiles_dir}}
#+end_src

** install elisps
#+begin_src yaml :tangle yes

#+end_src

* Bookmarks
  - [[http://answersforaws.com/episodes/2-ansible-and-aws/][Ansible and AWS - Answers for AWS]]
  - [[http://mosuke5.hateblo.jp/entry/2014/11/16/153223][Ansible, ソースインストールする際の Palybook の書き方 - Goldstine 研究所]]
